EDT/ZUP/zup_edt/src/InformationRegisters/НастройкиИнтеграцииРекрутинговыхСайтов/НастройкиИнтеграцииРекрутинговыхСайтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиИнтеграцииРекрутинговыхСайтов</name>
  <resources>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МаркерДоступа</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>МаркерОбновления</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияДействияМаркераДоступа</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ИнтервалПроверкиОткликовКандидатов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнтервалПроверкиКомментариевРезюме</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторПользователя</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РекрутинговыйСайт</name>
    <type>
      <types>CatalogRef.ИсточникиИнформацииОКандидатах</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/ZUP/zup_edt/src/InformationRegisters/НастройкиИнтеграцииРекрутинговыхСайтов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьНастройки(Сайт, Использовать, ИмяПользователя = "") Экспорт
	
	Пользователь = Пользователи.ТекущийПользователь();
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Пользователь = Пользователь;
	МенеджерЗаписи.РекрутинговыйСайт = Сайт;
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.Использовать = Использовать;
	Если Сайт = ИнтеграцияРекрутинговыхСайтовКлиентСервер.HeadHunter() Тогда
		Если Не МенеджерЗаписи.Выбран() Тогда
			Возврат;
		КонецЕсли;
	Иначе
		Если Не МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Пользователь = Пользователь;
			МенеджерЗаписи.РекрутинговыйСайт = Сайт;
		КонецЕсли;
		Если МенеджерЗаписи.ИмяПользователя <> ИмяПользователя Тогда
			МенеджерЗаписи.МаркерДоступа = "";
			МенеджерЗаписи.МаркерОбновления = "";
			МенеджерЗаписи.ДатаОкончанияДействияМаркераДоступа = Дата(1, 1, 1);
			МенеджерЗаписи.ИдентификаторПользователя = "";
		КонецЕсли;
		МенеджерЗаписи.ИмяПользователя = ИмяПользователя;
	КонецЕсли;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
